In [1]:
text = "To be or not to be"

In [2]:
[w for w in text if w.islower()]

['o', 'b', 'e', 'o', 'r', 'n', 'o', 't', 't', 'o', 'b', 'e']

In [3]:
[w for w in text if len(w) < 2]

['T',
 'o',
 ' ',
 'b',
 'e',
 ' ',
 'o',
 'r',
 ' ',
 'n',
 'o',
 't',
 ' ',
 't',
 'o',
 ' ',
 'b',
 'e']

In [4]:
[w for w in text]

['T',
 'o',
 ' ',
 'b',
 'e',
 ' ',
 'o',
 'r',
 ' ',
 'n',
 'o',
 't',
 ' ',
 't',
 'o',
 ' ',
 'b',
 'e']

In [5]:
[ w for w in text if w.endswith('o')]

['o', 'o', 'o', 'o']

In [6]:
for i in text:
    print(i)

T
o

b
e

o
r

n
o
t

t
o

b
e

In [7]:
text5 = 'ouagadougou'

In [8]:
text6 = text5.split('ou')
text6

['', 'agad', 'g', '']

In [9]:
'ou'.join(text6)

'ouagadougou'

In [10]:
list(text5)

['o', 'u', 'a', 'g', 'a', 'd', 'o', 'u', 'g', 'o', 'u']

In [11]:
text8 = '   A quick brown fox jumped over the lazy dog. '

In [12]:
text8.split(' ')

['',
 '',
 '',
 'A',
 'quick',
 'brown',
 'fox',
 'jumped',
 'over',
 'the',
 'lazy',
 'dog.',
 '']

In [13]:
text9 = text8.strip()
text9.split(' ')

['A', 'quick', 'brown', 'fox', 'jumped', 'over', 'the', 'lazy', 'dog.']

In [14]:
text9.find('o')

10

In [15]:
text9.rfind('o') #returns the last character with 'o' in this case its charater number 40 which is the first appearance of o from the right

40

In [16]:
text9.replace('o', 'O')

'A quick brOwn fOx jumped Over the lazy dOg.'

In [17]:
text10 = '"Ethics are built right into the ideals and objectives of the United Nations" #UNSG @ NY Society for Ethical Culture bit.ly/2guVeIr @UN @UN_Women'
text11 = text10.split(' ')
text11

['"Ethics',
 'are',
 'built',
 'right',
 'into',
 'the',
 'ideals',
 'and',
 'objectives',
 'of',
 'the',
 'United',
 'Nations"',
 '#UNSG',
 '@',
 'NY',
 'Society',
 'for',
 'Ethical',
 'Culture',
 'bit.ly/2guVeIr',
 '@UN',
 '@UN_Women']

In [18]:
tweet = "@nltk Text analysis is awesome! #regex #pandas #python"
[word for word in tweet.split() if word.startswith('#')]

['#regex', '#pandas', '#python']

In [19]:
[w for w in text11 if w.startswith('#')]

['#UNSG']

In [20]:
[w for w in text11 if w.startswith('@')]

['@', '@UN', '@UN_Women']

In [21]:
import re
[w for w in text11 if re.search('@[A-Za-z0-9_]+', w)]

['@UN', '@UN_Women']

### Meta-characters: Character matches

- . : wildcard, matches a singl character
- ^ : start of a string
- $ : End of a string
- [] : matches one of the set characters
- [a-z] : matches one of the range of characters a,b,...,z 
- [^abc] : matches a character that is not a, b or c
- a|b : matches either a or b where a and b are strings
- () : scoping for operators
- \ : Escape character for special characters (\t, \n, \b)

### Meta-characters: Character Symbols

- \b : matches word boundary
- \d : matches any digit, equivalent to [0-9]
- \D : mathes any non-digit, equivalent to [^0-9]
- \s : matches any whitespace, equivalent to [ \t\n\r\f\v]
- \S : matches any non-whitespace, equivalnt to [^ \t\n\r\f\v]
- \w : matches any alpanumeric character, equivalent to [A-Za-z0-9_]
- \W :matches any non-alphanumeric characters, equivalent to [^A-Za-z0-9_]

### Meta-characters: Repetitions
- * : matches zero or more occurences
- + : matches one or more occurences
- ? : matches zero or more occurences
- {n} : exactly n repetitions
- {n, } : atleast n repetitions
- {, n} : atmost n repetitions
- {m, n} :atleast m and atmost n repetitions

In [22]:
[w for w in text11 if re.search('@\w+', w)]

['@UN', '@UN_Women']

In [23]:
re.findall(r'[aeiou]', text5) #returns all vowels in text

['o', 'u', 'a', 'a', 'o', 'u', 'o', 'u']

In [24]:
re.findall(r'[^aeiou]', text5) #returns all non-vowels in text

['g', 'd', 'g']

In [25]:
datestr = '23-10-2002\n23/10/2002\n10/23/2002\n23 oct 2002\n23 october 2002\noct 23, 2002\noctober 23, 2002\n'
re.findall(r'\d{2}[/-]\d{2}[/-]\d{4}', datestr)

['23-10-2002', '23/10/2002', '10/23/2002']

In [26]:
re.findall(r'\d{2}[/-]\d{2}[/-]\d{2,4}', datestr)

['23-10-2002', '23/10/2002', '10/23/2002']

In [27]:
re.findall(r'\d{1,2}[/-]\d{1,2}[/-]\d{2,4}', datestr)

['23-10-2002', '23/10/2002', '10/23/2002']

In [28]:
re.findall(r'\d{2} (jan|feb|mar|apr|may|jun|jul|aug|oct|nov|dec) \d{4}', datestr) #returns anything that matched what your input in the brackets was

['oct']

In [29]:
re.findall(r'\d{2} (?:jan|feb|mar|apr|may|jun|jul|aug|oct|nov|dec) \d{4}', datestr) #pulls out now the whole string that matched  any of the inputs in the brackets

['23 oct 2002']

In [30]:
re.findall(r'\d{2} (?:jan|feb|mar|apr|may|jun|jul|aug|oct|nov|dec)[a-z]* \d{4}', datestr) #pulls out now the whole string that matched  any of the inputs in the brackets extended by a-z and * because it may have only oct or october. + would only return october

['23 oct 2002', '23 october 2002']

In [31]:
re.findall(r'\d{2} (?:jan|feb|mar|apr|may|jun|jul|aug|oct|nov|dec)[a-z]+ \d{4}', datestr) #pulls out now the whole string that matched  any of the inputs in the brackets extended by a-z and * because it may have only oct or october. + would only return october

['23 october 2002']

In [32]:
re.findall(r'(?:\d{2})?(?:jan|feb|mar|apr|may|jun|jul|aug|oct|nov|dec)[a-z]* (?:\d{2}, )?\d{4}', datestr) #pulls out now the who

['oct 2002', 'october 2002', 'oct 23, 2002', 'october 23, 2002']

In [33]:
re.findall(r'(?:\d{1,2})?(?:jan|feb|mar|apr|may|jun|jul|aug|oct|nov|dec)[a-z]* (?:\d{1,2}, )?\d{4}', datestr) #pulls out now the who

['oct 2002', 'october 2002', 'oct 23, 2002', 'october 23, 2002']

### Regex with pandas and named groups

In [34]:
import pandas as pd

time_sentences = {"monday: The doctors appointment is at 2:45pm.",
                  "Teusday: The dentist's appointment is at 11:30 am",
                  "Wednesday : At 7:00pm, there is a basketball game",
                  "Thursday : Be back home by 11:15pm at the latest",
                  "Friday : Take the train at 08:10 am, arrive at 9:00am"}
df =  pd.DataFrame(time_sentences, columns = ['text'])
df

                                                text
0      monday: The doctors appointment is at 2:45pm.
1  Teusday: The dentist's appointment is at 11:30 am
2  Friday : Take the train at 08:10 am, arrive at...
3   Thursday : Be back home by 11:15pm at the latest
4  Wednesday : At 7:00pm, there is a basketball game

In [35]:
df['text'].str.len()

0    45
1    49
2    53
3    48
4    49
Name: text, dtype: int64

In [36]:
df['text'].str.split().str.len() #split the string on any whitespaes and check the number of characters contained in each  string

0     7
1     8
2    11
3    10
4     9
Name: text, dtype: int64

In [37]:
df['text'].str.contains('appointment') #checks which string contains the word appointments

0     True
1     True
2    False
3    False
4    False
Name: text, dtype: bool

In [38]:
df['text'].str.count(r'\d') #checking how many times a digit occurs in every string

0    3
1    4
2    7
3    4
4    3
Name: text, dtype: int64

In [39]:
df['text'].str.findall(r'\d') #we can find all the digit occurences are using findall

0                [2, 4, 5]
1             [1, 1, 3, 0]
2    [0, 8, 1, 0, 9, 0, 0]
3             [1, 1, 1, 5]
4                [7, 0, 0]
Name: text, dtype: object

In [48]:
df['text'].str.findall(r'\d') #we can find all the digit occurences are using findall

0                [2, 4, 5]
1             [1, 1, 3, 0]
2    [0, 8, 1, 0, 9, 0, 0]
3             [1, 1, 1, 5]
4                [7, 0, 0]
Name: text, dtype: object

In [41]:
df['text'].str.findall(r'(\d?\d):(\d\d)') #get all the timesas they appear in each string

0              [(2, 45)]
1             [(11, 30)]
2    [(08, 10), (9, 00)]
3             [(11, 15)]
4              [(7, 00)]
Name: text, dtype: object

In [42]:
df['text'].str.replace(r'\w+day\b', '???') #replacing every weekday with question marks
#we find all words that end with ..day and replace them with three question marks

0           ???: The doctors appointment is at 2:45pm.
1        ???: The dentist's appointment is at 11:30 am
2    ??? : Take the train at 08:10 am, arrive at 9:...
3          ??? : Be back home by 11:15pm at the latest
4          ??? : At 7:00pm, there is a basketball game
Name: text, dtype: object

In [50]:
df['text'].str.replace(r'(\w+day\b)', lambda x: x.groups()[0][:3]) #we want to replace every weekday with the first three letters of the weekday

0           mon: The doctors appointment is at 2:45pm.
1        Teu: The dentist's appointment is at 11:30 am
2    Fri : Take the train at 08:10 am, arrive at 9:...
3          Thu : Be back home by 11:15pm at the latest
4          Wed : At 7:00pm, there is a basketball game
Name: text, dtype: object

In [44]:
df['text'].str.extract(r'(\d?\d):(\d\d)')#allows us to create new colums with the hour and minuteof the time i each string
#only extracts group from the first match of the pattern use extractall to get all matchee

    0   1
0   2  45
1  11  30
2  08  10
3  11  15
4   7  00

In [45]:
df['text'].str.extractall(r'(\d?\d):(\d\d)') #extracts all times and creates a new column for hour and minute

          0   1
  match
0 0       2  45
1 0      11  30
2 0      08  10
  1       9  00
3 0      11  15
4 0       7  00

In [46]:
df['text'].str.extractall(r'((\d?\d):(\d\d) ?([ap]m))') #extracts the first group as the whole time and then splits the time in hours, minutes and period

                0   1   2   3
  match
0 0        2:45pm   2  45  pm
1 0      11:30 am  11  30  am
2 0      08:10 am  08  10  am
  1        9:00am   9  00  am
3 0       11:15pm  11  15  pm
4 0        7:00pm   7  00  pm

In [47]:
df['text'].str.extractall(r'(?P<time>(?P<hour>\d?\d):(?P<minute>\d\d) ?(?P<period>[ap]m))') #extracting time and naming oru columns
#df['text'].str.extractall(r'(?P<time>(?P<hour>\d?\d):(?P<minute>\d\d) ?(?P<period>[ap]m))')

             time hour minute period
  match
0 0        2:45pm    2     45     pm
1 0      11:30 am   11     30     am
2 0      08:10 am   08     10     am
  1        9:00am    9     00     am
3 0       11:15pm   11     15     pm
4 0        7:00pm    7     00     pm

### Internationalization and issues with Non-ASCII Characters
- English is very well encoded using ASCII : American Standard code for Information Interchange

In [98]:
t  = {'Mar-20-2009 Mar 20, 2009 March 20, 2009 Mar. 20, 2009 Mar 20 2009',
      '20 Mar 2009; 20 March 2009; 20 Mar. 2009; 20 March, 2009',
      'Mar 20th, 2009; Mar 21st, 2009; Mar 22nd, 2009',
      'Feb 2009; Sep 2009; Oct 2010'}
df1 = pd.DataFrame(t, columns = ['text'])
df1

                                                text
0  Mar-20-2009 Mar 20, 2009 March 20, 2009 Mar. 2...
1                       Feb 2009; Sep 2009; Oct 2010
2  20 Mar 2009; 20 March 2009; 20 Mar. 2009; 20 M...
3     Mar 20th, 2009; Mar 21st, 2009; Mar 22nd, 2009

In [99]:
df1['text'].str.findall(r'(\w{1,7})[-,. ](\d?\d)[-,. ](\d\d\d\d)')

0    [(Mar, 20, 2009), (Mar, 20, 2009)]
1                                    []
2                                    []
3                                    []
Name: text, dtype: object

In [100]:
y = df1['text'].str.findall(r'(\w{,12})[-,. ]*(\d?\d)[-,. ]*(\d?\d?\d?\d)')
for i in y: print(i)

[('Mar', '20', '2009'), ('Mar', '20', '2009'), ('March', '20', '2009'), ('Mar', '20', '2009'), ('Mar', '20', '2009')]
[('Feb', '20', '09'), ('Sep', '20', '09'), ('Oct', '20', '10')]
[('', '2', '0'), ('Mar', '20', '09'), ('', '2', '0'), ('March', '20', '09'), ('', '2', '0'), ('Mar', '20', '09'), ('', '2', '0'), ('March', '20', '09')]
[('Mar', '2', '0'), ('th', '20', '09'), ('Mar', '2', '1'), ('st', '20', '09'), ('Mar', '2', '2'), ('nd', '20', '09')]

In [101]:
jan = df1['text'].str.replace(r'(Jan[a-z]*)', '01')
jan

0    Mar-20-2009 Mar 20, 2009 March 20, 2009 Mar. 2...
1                         Feb 2009; Sep 2009; Oct 2010
2    20 Mar 2009; 20 March 2009; 20 Mar. 2009; 20 M...
3       Mar 20th, 2009; Mar 21st, 2009; Mar 22nd, 2009
Name: text, dtype: object

In [102]:
feb = jan.str.replace(r'(Feb[a-z]*)', '02')
feb

0    Mar-20-2009 Mar 20, 2009 March 20, 2009 Mar. 2...
1                          02 2009; Sep 2009; Oct 2010
2    20 Mar 2009; 20 March 2009; 20 Mar. 2009; 20 M...
3       Mar 20th, 2009; Mar 21st, 2009; Mar 22nd, 2009
Name: text, dtype: object

In [103]:
mar = feb.str.replace(r'(Mar[a-z]*)', '03')
sep = mar.str.replace(r'(Sep[a-z]*)', '09')
octo = sep.str.replace(r'(Oct[a-z]*)', '10')
octo

0    03-20-2009 03 20, 2009 03 20, 2009 03. 20, 200...
1                            02 2009; 09 2009; 10 2010
2     20 03 2009; 20 03 2009; 20 03. 2009; 20 03, 2009
3          03 20th, 2009; 03 21st, 2009; 03 22nd, 2009
Name: text, dtype: object

In [113]:
y = octo.str.findall(r'(\d?\d)*[/ , -](\d?\d)*[/ -](\d?\d?\d?\d)\b')
for i in y: print(i)

[('03', '20', '2009'), ('', '03', '20'), ('', '', '2009'), ('', '03', '20'), ('', '', '2009'), ('20', '', '2009'), ('', '03', '20')]
[('', '09', '2009'), ('', '10', '2010')]
[('20', '03', '2009'), ('', '20', '03'), ('', '20', '03'), ('', '20', '03'), ('', '', '2009')]
[('', '', '2009'), ('', '', '2009'), ('', '', '2009')]

In [129]:
y = octo.str.findall(r'(\d{1,2})*[/ , -]*(\d{,2}?)*[/ -](\d{2,4})\b')
for i in y: print(i)

[('03', '', '2009'), ('', '', '20'), ('', '', '03'), ('', '', '20'), ('', '', '03'), ('', '', '20'), ('', '', '03'), ('', '', '2009')]
[('02', '', '2009'), ('', '', '2009'), ('', '', '2010')]
[('20', '', '2009'), ('', '', '03'), ('', '', '2009'), ('', '', '03'), ('', '', '2009'), ('', '', '03'), ('', '', '2009')]
[('', '', '2009'), ('', '', '03'), ('', '', '2009'), ('', '', '03'), ('', '', '2009')]